# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён, 
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def diction(*words):
    any_diction = {}
    for i in sorted(words):
        first_let = i[0]
        if first_let not in any_diction:
            any_diction[first_let] = [i]
        else:
            any_diction[first_let] += [i]

    return any_diction


print(diction("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))








