# Написать программу, в которой пользователь будет задавать 2 строки, а программа определять кол-во вхождений одной строки в другой
# qwereert,   wer  =====> 1
# qerqerfgvbn, qer  =====> 2

text1 = input()
text2 = input()

print(text1.count(text2))


